emacs/.emacs.d/init.org
#+TITLE: Tareifz Emacs Configuration
#+OPTIONA: toc:4 h:4
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp	:tangle yes

* Configurations
** Startup
*** Package Archives
    list of some of emacs packages archive repositories:

#+BEGIN_SRC emacs-lisp
(require 'package)
(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/")
        ("marmalade" . "https://marmalade-repo.org/packages/")
        ("melpa" . "https://melpa.org/packages/")))
(package-initialize)
#+END_SRC

*** Use-package
    use-package is a macro to install and configure packages;

#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (progn
    (package-refresh-contents)
    (package-install 'use-package)))

(require 'use-package)
#+END_SRC

    bind-key is a macro comes with use-package:

#+BEGIN_SRC emacs-lisp
(require 'bind-key)
#+END_SRC

    install packages if not in the system.

#+BEGIN_SRC emacs-lisp
(setq use-package-always-ensure t)
#+END_SRC

*** Personal Informations
    editor user informations:

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Tareif Al-Zamil"
      user-mail-address "root@tareifz.me")
#+END_SRC

*** Emacs Daemon
    Stopping the emacs daemon:

#+BEGIN_SRC emacs-lisp
(defun server-shutdown ()
  "Save buffers, Quit, and Shutdown (kill) server"
  (interactive)
  (save-some-buffers)
  (kill-emacs)
  )
#+END_SRC

    Make emacs register as a client with the GNOME session manager, and shutdown gracefully when the session ends:

#+BEGIN_SRC emacs-lisp
;; save & shutdown when we get an "end of session" signal on dbus
(require 'dbus)

(defun my-register-signals (client-path)
  "Register for the 'QueryEndSession' and 'EndSession' signals from
Gnome SessionManager.

When we receive 'QueryEndSession', we just respond with
'EndSessionResponse(true, \"\")'.  When we receive 'EndSession', we
append this EndSessionResponse to kill-emacs-hook, and then call
kill-emacs.  This way, we can shut down the Emacs daemon cleanly
before we send our 'ok' to the SessionManager."
  (setq my-gnome-client-path client-path)
  (let ( (end-session-response (lambda (&optional arg)
                                 (dbus-call-method-asynchronously
                                  :session "org.gnome.SessionManager" my-gnome-client-path
                                  "org.gnome.SessionManager.ClientPrivate" "EndSessionResponse" nil
                                  t "") ) ) )
         (dbus-register-signal
          :session "org.gnome.SessionManager" my-gnome-client-path
          "org.gnome.SessionManager.ClientPrivate" "QueryEndSession"
          end-session-response )
         (dbus-register-signal
          :session "org.gnome.SessionManager" my-gnome-client-path
          "org.gnome.SessionManager.ClientPrivate" "EndSession"
          `(lambda (arg)
             (add-hook 'kill-emacs-hook ,end-session-response t)
             (kill-emacs) ) ) ) )

;; DESKTOP_AUTOSTART_ID is set by the Gnome desktop manager when emacs
;; is autostarted.  We can use it to register as a client with gnome
;; SessionManager.
(dbus-call-method-asynchronously
 :session "org.gnome.SessionManager"
 "/org/gnome/SessionManager"
 "org.gnome.SessionManager" "RegisterClient" 'my-register-signals
 "Emacs server" (getenv "DESKTOP_AUTOSTART_ID"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-hook 'after-make-frame-functions
          (lambda (frame)
                  (with-selected-frame frame
                                       (progn (menu-bar-mode -1)
                                       (tool-bar-mode -1)
                                       (toggle-scroll-bar -1)
                                       (global-linum-mode t)
                                       (setq-default linum-format " %d ")))))
#+END_SRC

** General Settings
