emacs/.emacs.d/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tareifz Emacs Configuration</title>
<!-- 2018-11-22 Thu 18:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Tareif Al-Zamil" />
</head>
<body>
<div id="content">
<h1 class="title">Tareifz Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Configurations</a>
<ul>
<li><a href="#sec-1-1">1.1. Startup</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Package Archives</a></li>
<li><a href="#sec-1-1-2">1.1.2. Use-package</a></li>
<li><a href="#sec-1-1-3">1.1.3. Personal Informations</a></li>
<li><a href="#sec-1-1-4">1.1.4. Emacs Daemon</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. General Settings</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Confirmation</a></li>
<li><a href="#sec-1-2-2">1.2.2. Highlight Parentheses</a></li>
<li><a href="#sec-1-2-3">1.2.3. Highlight Tabulations</a></li>
<li><a href="#sec-1-2-4">1.2.4. Show Trailing Whitespaces</a></li>
<li><a href="#sec-1-2-5">1.2.5. Remove Useless Whitespaces</a></li>
<li><a href="#sec-1-2-6">1.2.6. Skip Splash Screen</a></li>
<li><a href="#sec-1-2-7">1.2.7. Show Empty Line Markers</a></li>
<li><a href="#sec-1-2-8">1.2.8. Make Ibuffer Default</a></li>
<li><a href="#sec-1-2-9">1.2.9. Delete Selection</a></li>
<li><a href="#sec-1-2-10">1.2.10. Highlight Current Line</a></li>
<li><a href="#sec-1-2-11">1.2.11. Refreash File</a></li>
<li><a href="#sec-1-2-12">1.2.12. Prettify Symbols</a></li>
<li><a href="#sec-1-2-13">1.2.13. Indentation</a></li>
<li><a href="#sec-1-2-14">1.2.14. Ido Mode</a></li>
<li><a href="#sec-1-2-15">1.2.15. Backup Files</a></li>
<li><a href="#sec-1-2-16">1.2.16. File Encoding</a></li>
<li><a href="#sec-1-2-17">1.2.17. Global Variables</a></li>
<li><a href="#sec-1-2-18">1.2.18. Font Settings</a></li>
<li><a href="#sec-1-2-19">1.2.19. Custom Settings File</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Functions</a></li>
<li><a href="#sec-1-4">1.4. Key Bindings</a></li>
<li><a href="#sec-1-5">1.5. Themes</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Custom User Themes</a></li>
<li><a href="#sec-1-5-2">1.5.2. Theme packages</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Packages</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. [org-mode]</a></li>
<li><a href="#sec-1-6-2">1.6.2. [try]</a></li>
<li><a href="#sec-1-6-3">1.6.3. [smartparens]</a></li>
<li><a href="#sec-1-6-4">1.6.4. [rainbow-mode]</a></li>
<li><a href="#sec-1-6-5">1.6.5. [rainbow-delimiters]</a></li>
<li><a href="#sec-1-6-6">1.6.6. [aggressive-indent]</a></li>
<li><a href="#sec-1-6-7">1.6.7. [beacon]</a></li>
<li><a href="#sec-1-6-8">1.6.8. [smex]</a></li>
<li><a href="#sec-1-6-9">1.6.9. [company]</a></li>
<li><a href="#sec-1-6-10">1.6.10. [rust-mode]</a></li>
<li><a href="#sec-1-6-11">1.6.11. [racer]</a></li>
<li><a href="#sec-1-6-12">1.6.12. [multiple-cursors]</a></li>
<li><a href="#sec-1-6-13">1.6.13. [switch-window]</a></li>
<li><a href="#sec-1-6-14">1.6.14. [web-mode]</a></li>
<li><a href="#sec-1-6-15">1.6.15. [js2-mode]</a></li>
<li><a href="#sec-1-6-16">1.6.16. [electric-operator]</a></li>
<li><a href="#sec-1-6-17">1.6.17. [impatient-mode]</a></li>
<li><a href="#sec-1-6-18">1.6.18. [which-key]</a></li>
<li><a href="#sec-1-6-19">1.6.19. [expand-region]</a></li>
<li><a href="#sec-1-6-20">1.6.20. [flycheck]</a></li>
<li><a href="#sec-1-6-21">1.6.21. [flycheck-rust]</a></li>
<li><a href="#sec-1-6-22">1.6.22. [geiser]</a></li>
<li><a href="#sec-1-6-23">1.6.23. [flymd]</a></li>
<li><a href="#sec-1-6-24">1.6.24. [emmet-mode]</a></li>
<li><a href="#sec-1-6-25">1.6.25. [diff-hl]</a></li>
<li><a href="#sec-1-6-26">1.6.26. [projectile]</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Configurations</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Startup</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Package Archives</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
list of some of emacs packages archive repositories:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'package)
(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/")
        ("marmalade" . "https://marmalade-repo.org/packages/")
        ("melpa" . "https://melpa.org/packages/")))
(package-initialize)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Use-package</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
use-package is a macro to install and configure packages;
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(unless (package-installed-p 'use-package)
  (progn
    (package-refresh-contents)
    (package-install 'use-package)))

(require 'use-package)
</pre>
</div>

<p>
bind-key is a macro comes with use-package:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'bind-key)
</pre>
</div>

<p>
install packages if not in the system.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq use-package-always-ensure t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Personal Informations</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
editor user informations:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name "Tareif Al-Zamil"
      user-mail-address "root@tareifz.me")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Emacs Daemon</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Stopping the emacs daemon:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun server-shutdown ()
  "Save buffers, Quit, and Shutdown (kill) server"
  (interactive)
  (save-some-buffers)
  (kill-emacs)
  )
</pre>
</div>

<p>
Make emacs register as a client with the GNOME session manager, and shutdown gracefully when the session ends:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; save &amp; shutdown when we get an "end of session" signal on dbus
(require 'dbus)

(defun my-register-signals (client-path)
  "Register for the 'QueryEndSession' and 'EndSession' signals from
Gnome SessionManager.

When we receive 'QueryEndSession', we just respond with
'EndSessionResponse(true, \"\")'.  When we receive 'EndSession', we
append this EndSessionResponse to kill-emacs-hook, and then call
kill-emacs.  This way, we can shut down the Emacs daemon cleanly
before we send our 'ok' to the SessionManager."
  (setq my-gnome-client-path client-path)
  (let ( (end-session-response (lambda (&amp;optional arg)
                                 (dbus-call-method-asynchronously
                                  :session "org.gnome.SessionManager" my-gnome-client-path
                                  "org.gnome.SessionManager.ClientPrivate" "EndSessionResponse" nil
                                  t "") ) ) )
         (dbus-register-signal
          :session "org.gnome.SessionManager" my-gnome-client-path
          "org.gnome.SessionManager.ClientPrivate" "QueryEndSession"
          end-session-response )
         (dbus-register-signal
          :session "org.gnome.SessionManager" my-gnome-client-path
          "org.gnome.SessionManager.ClientPrivate" "EndSession"
          `(lambda (arg)
             (add-hook 'kill-emacs-hook ,end-session-response t)
             (kill-emacs) ) ) ) )

;; DESKTOP_AUTOSTART_ID is set by the Gnome desktop manager when emacs
;; is autostarted.  We can use it to register as a client with gnome
;; SessionManager.
(dbus-call-method-asynchronously
 :session "org.gnome.SessionManager"
 "/org/gnome/SessionManager"
 "org.gnome.SessionManager" "RegisterClient" 'my-register-signals
 "Emacs server" (getenv "DESKTOP_AUTOSTART_ID"))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-make-frame-functions
          (lambda (frame)
                  (with-selected-frame frame
                                       (progn (menu-bar-mode -1)
                                       (tool-bar-mode -1)
                                       (toggle-scroll-bar -1)
                                       (global-linum-mode t)
                                       (setq-default linum-format " %d ")))))
</pre>
</div>
</div>
</div>
</div>
