emacs/.emacs.d/init.org
*** Confirmation
    Ask "y" or "n" instead of "yes" or "no":

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

*** Highlight Parentheses
    Highlight corresponding parentheses when cursor is on one:

#+BEGIN_SRC emacs-lisp
(show-paren-mode t)
#+END_SRC

*** Highlight Tabulations

#+BEGIN_SRC emacs-lisp
(setq-default highlight-tabs t)
#+END_SRC

*** Show Trailing Whitespaces

#+BEGIN_SRC emacs-lisp
(setq-default show-trailing-whitespace t)
#+END_SRC

*** Remove Useless Whitespaces
    Remove useless whitespace before saving a file:

#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'whitespace-cleanup)
(add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))
#+END_SRC

*** Skip Splash Screen

#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t
      initial-scratch-message nil
      initial-major-mode 'org-mode)
#+END_SRC

*** Show Empty Line Markers

#+BEGIN_SRC emacs-lisp :tangle no
(setq-default indicate-empty-lines t)
(when (not indicate-empty-lines)
(toggle-indicate-empty-lines))
#+END_SRC

*** Make Ibuffer Default

#+BEGIN_SRC emacs-lisp
(defalias 'list-buffers 'ibuffer)
#+END_SRC

*** Delete Selection
    Make typing delete/overwrites selected text:

#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)
#+END_SRC

*** Highlight Current Line

#+BEGIN_SRC emacs-lisp
(global-hl-line-mode 1)
#+END_SRC

*** Refreash File
    When a file is updated outside emacs, make it update if it's already opened in emacs:

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1)
#+END_SRC

*** Prettify Symbols
    Make some word or string show as pretty Unicode symbols.

#+BEGIN_SRC emacs-lisp
(defun my-prettify-symbols-list ()
  "Make some word or string show as pretty Unicode symbols."
  (setq prettify-symbols-alist
        '(
          ("lambda" . 955) ;; λ
          ("->" . 8594)    ;; →
          ("=>" . 8658)    ;; ⇒
          ("<=" . 8804)    ;; ≤
          (">=" . 8805)    ;; ≥
          ("!=" . 8800)    ;; ≠
          ("===" . 8801)   ;; ≡
          ("!==" . 8802)   ;; ≢
          )))

(add-hook 'prog-mode-hook 'my-prettify-symbols-list)

;; display “lambda” as “λ”
(global-prettify-symbols-mode 1)
#+END_SRC

*** Indentation
**** Spaces or Tabs
     Indent using tabs:

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

**** Tab Width
     Width of two spaces:

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 2)
(setq-default default-tab-width 2)
#+END_SRC

**** Javascript Indentation Size
     Two spaces:

#+BEGIN_SRC emacs-lisp
(setq-default js-indent-level 2)
#+END_SRC

**** Indent or Insert Tab
     Make tab key call indent command or insert tab character,
depending on cursor position:

#+BEGIN_SRC emacs-lisp
(setq-default tab-always-indent nil)
#+END_SRC

*** Ido Mode

#+BEGIN_SRC emacs-lisp
(progn
  ;; make buffer switch command do suggestions, also for find-file command
  (require 'ido)
  (ido-mode 1)

  ;; show choices vertically
  (if (version< emacs-version "25")
      (progn
        (make-local-variable 'ido-separator)
        (setq ido-decorations "\n"))
    (progn
      (make-local-variable 'ido-decorations)
      (setf (nth 2 ido-decorations) "\n")))

  ;; show any name that has the chars you typed
  (setq ido-enable-flex-matching t)
  ;; use current pane for newly opened file
  (setq ido-default-file-method 'selected-window)
  ;; use current pane for newly switched buffer
  (setq ido-default-buffer-method 'selected-window)
  ;; stop ido from suggesting when naming new file
  (define-key (cdr ido-minor-mode-map-entry) [remap write-file] nil))

;; big minibuffer height, for ido to show choices vertically
(setq max-mini-window-height 0.5)

(require 'ido)
;; stop ido suggestion when doing a save-as
(define-key (cdr ido-minor-mode-map-entry) [remap write-file] nil)
#+END_SRC

*** Backup Files
    Remove all backup files:

#+BEGIN_SRC emacs-lisp
(setq make-backup-files nil)
(setq backup-inhibited t)
(setq auto-save-default nil)
#+END_SRC

*** File Encoding
    Set locale to UTF-8:

#+BEGIN_SRC emacs-lisp
(set-language-environment 'utf-8)
(set-terminal-coding-system 'utf-8)
(setq locale-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC

