emacs/.emacs.d/init.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> General Settings</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Confirmation</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Ask "y" or "n" instead of "yes" or "no":
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Highlight Parentheses</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Highlight corresponding parentheses when cursor is on one:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(show-paren-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Highlight Tabulations</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default highlight-tabs t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Show Trailing Whitespaces</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default show-trailing-whitespace t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Remove Useless Whitespaces</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Remove useless whitespace before saving a file:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'before-save-hook 'whitespace-cleanup)
(add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> Skip Splash Screen</h4>
<div class="outline-text-4" id="text-1-2-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq inhibit-splash-screen t
      initial-scratch-message nil
      initial-major-mode 'org-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-7" class="outline-4">
<h4 id="sec-1-2-7"><span class="section-number-4">1.2.7</span> Show Empty Line Markers</h4>
<div class="outline-text-4" id="text-1-2-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default indicate-empty-lines t)
(when (not indicate-empty-lines)
(toggle-indicate-empty-lines))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-8" class="outline-4">
<h4 id="sec-1-2-8"><span class="section-number-4">1.2.8</span> Make Ibuffer Default</h4>
<div class="outline-text-4" id="text-1-2-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defalias 'list-buffers 'ibuffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-9" class="outline-4">
<h4 id="sec-1-2-9"><span class="section-number-4">1.2.9</span> Delete Selection</h4>
<div class="outline-text-4" id="text-1-2-9">
<p>
Make typing delete/overwrites selected text:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(delete-selection-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-10" class="outline-4">
<h4 id="sec-1-2-10"><span class="section-number-4">1.2.10</span> Highlight Current Line</h4>
<div class="outline-text-4" id="text-1-2-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-hl-line-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-11" class="outline-4">
<h4 id="sec-1-2-11"><span class="section-number-4">1.2.11</span> Refreash File</h4>
<div class="outline-text-4" id="text-1-2-11">
<p>
When a file is updated outside emacs, make it update if it's already opened in emacs:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-auto-revert-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-12" class="outline-4">
<h4 id="sec-1-2-12"><span class="section-number-4">1.2.12</span> Prettify Symbols</h4>
<div class="outline-text-4" id="text-1-2-12">
<p>
Make some word or string show as pretty Unicode symbols.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun my-prettify-symbols-list ()
  "Make some word or string show as pretty Unicode symbols."
  (setq prettify-symbols-alist
        '(
          ("lambda" . 955) ;; λ
          ("-&gt;" . 8594)    ;; →
          ("=&gt;" . 8658)    ;; ⇒
          ("&lt;=" . 8804)    ;; ≤
          ("&gt;=" . 8805)    ;; ≥
          ("!=" . 8800)    ;; ≠
          ("===" . 8801)   ;; ≡
          ("!==" . 8802)   ;; ≢
          )))

(add-hook 'prog-mode-hook 'my-prettify-symbols-list)

;; display “lambda” as “λ”
(global-prettify-symbols-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-13" class="outline-4">
<h4 id="sec-1-2-13"><span class="section-number-4">1.2.13</span> Indentation</h4>
<div class="outline-text-4" id="text-1-2-13">
</div><ol class="org-ol"><li><a id="sec-1-2-13-1" name="sec-1-2-13-1"></a>Spaces or Tabs<br  /><div class="outline-text-5" id="text-1-2-13-1">
<p>
Indent using tabs:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default indent-tabs-mode nil)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-13-2" name="sec-1-2-13-2"></a>Tab Width<br  /><div class="outline-text-5" id="text-1-2-13-2">
<p>
Width of two spaces:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default tab-width 2)
(setq-default default-tab-width 2)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-13-3" name="sec-1-2-13-3"></a>Javascript Indentation Size<br  /><div class="outline-text-5" id="text-1-2-13-3">
<p>
Two spaces:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default js-indent-level 2)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-13-4" name="sec-1-2-13-4"></a>Indent or Insert Tab<br  /><div class="outline-text-5" id="text-1-2-13-4">
<p>
     Make tab key call indent command or insert tab character,
depending on cursor position:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default tab-always-indent nil)
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-2-14" class="outline-4">
<h4 id="sec-1-2-14"><span class="section-number-4">1.2.14</span> Ido Mode</h4>
<div class="outline-text-4" id="text-1-2-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(progn
  ;; make buffer switch command do suggestions, also for find-file command
  (require 'ido)
  (ido-mode 1)

  ;; show choices vertically
  (if (version&lt; emacs-version "25")
      (progn
        (make-local-variable 'ido-separator)
        (setq ido-decorations "\n"))
    (progn
      (make-local-variable 'ido-decorations)
      (setf (nth 2 ido-decorations) "\n")))

  ;; show any name that has the chars you typed
  (setq ido-enable-flex-matching t)
  ;; use current pane for newly opened file
  (setq ido-default-file-method 'selected-window)
  ;; use current pane for newly switched buffer
  (setq ido-default-buffer-method 'selected-window)
  ;; stop ido from suggesting when naming new file
  (define-key (cdr ido-minor-mode-map-entry) [remap write-file] nil))

;; big minibuffer height, for ido to show choices vertically
(setq max-mini-window-height 0.5)

(require 'ido)
;; stop ido suggestion when doing a save-as
(define-key (cdr ido-minor-mode-map-entry) [remap write-file] nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-15" class="outline-4">
<h4 id="sec-1-2-15"><span class="section-number-4">1.2.15</span> Backup Files</h4>
<div class="outline-text-4" id="text-1-2-15">
<p>
Remove all backup files:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq make-backup-files nil)
(setq backup-inhibited t)
(setq auto-save-default nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-16" class="outline-4">
<h4 id="sec-1-2-16"><span class="section-number-4">1.2.16</span> File Encoding</h4>
<div class="outline-text-4" id="text-1-2-16">
<p>
Set locale to UTF-8:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-language-environment 'utf-8)
(set-terminal-coding-system 'utf-8)
(setq locale-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
</pre>
</div>
</div>
</div>
