emacs/.emacs.d/init.org
*** Global Variables
    Disable menu bar:

#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
#+END_SRC

    Disable tool bar:

#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
#+END_SRC

    Disable scroll bar:

#+BEGIN_SRC emacs-lisp
(toggle-scroll-bar -1)
#+END_SRC

    Display line number:

#+BEGIN_SRC emacs-lisp
(global-linum-mode t)
(setq-default linum-format " %d ")
#+END_SRC

    Every time bookmark is changed, automatically save it:

#+BEGIN_SRC emacs-lisp
(setq bookmark-save-flag 1)
#+END_SRC

*** Font Settings
    General settings:

#+BEGIN_SRC emacs-lisp
;; (set-frame-font "Ubuntu Mono")
;; (set-frame-font "More Perfect DOS VGA")
;; (set-frame-font "Unifont")
;; (set-frame-font "Terminus:antialias=none")
;; (set-face-attribute 'default nil :height 120)
;; (set-frame-font "Monaco")
(set-frame-font "Hack")
(set-face-attribute 'default nil :height 120)
#+END_SRC

    For Arch-Linux:

#+BEGIN_SRC emacs-lisp :tangle no
(set-frame-font "xos4 Terminus:antialias=none")
(set-face-attribute 'default nil :height 120)
#+END_SRC

*** Custom Settings File
    Keep auto-generated settings in seperate file:

#+BEGIN_SRC emacs-lisp
(setq-default custom-file "~/.emacs.d/auto-generated-customized-settings.el")
(load-file custom-file)
#+END_SRC
** Functions

#+BEGIN_SRC emacs-lisp
(defun tareifz/load-only-theme ()
  "Disable all themes and then load a single theme interactively."
  (interactive)
  (while custom-enabled-themes
    (disable-theme (car custom-enabled-themes)))
  (call-interactively 'load-theme))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun tareifz/kill-line ()
  "Killing current line with the new line character, and put the cursor at the beginning of the line."
  (interactive)
  (let (line-begin line-end)
    (setq line-begin (line-beginning-position))
    (setq line-end (if (= (point-max) (line-end-position))
                       (progn
                         (line-end-position))
                     (progn
                       (forward-line 1)
                       (line-beginning-position))))
    (kill-region line-begin line-end)
    (beginning-of-line))
  )
#+END_SRC
** Key Bindings
   Override [C-k] (kill-to-end-of-line).
the bind-key* (with star) will override key bindings in all minor modes:

#+BEGIN_SRC emacs-lisp
(bind-key* "C-k" 'tareifz/kill-line)
#+END_SRC
** Themes
*** Custom User Themes

#+BEGIN_SRC emacs-lisp :tangle no
(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
;; (load-file "~/.emacs.d/themes/tareifz-basic-theme.el")
;; (load-file "~/.emacs.d/themes/tareifz-shadows-theme.el")
#+END_SRC

*** Theme packages

#+BEGIN_SRC emacs-lisp
;; (use-package sourcerer-theme)
;; (use-package dracula-theme)
;; (use-package atom-one-dark-theme)
(use-package hydandata-light-theme)
#+END_SRC

** Packages
*** [org-mode]

#+BEGIN_SRC emacs-lisp
(use-package org)
#+END_SRC

*** [try]
    This package let you try packages without installing

#+BEGIN_SRC emacs-lisp
(use-package try)
#+END_SRC

*** [smartparens]
    Auto-close parens:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package smartparens
  :config
  (smartparens-global-mode t))
#+END_SRC

*** [rainbow-mode]
    Represent colors with the color they represent as background:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package rainbow-mode
  :config
  (add-hook 'prog-mode-hook #'rainbow-mode))
#+END_SRC

*** [rainbow-delimiters]
    Rainbow parentheses:

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :requires rainbow-mode
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC

*** [aggressive-indent]
    Minor mode that keeps your code always indented:

#+BEGIN_SRC emacs-lisp
(use-package aggressive-indent
  :config
  (global-aggressive-indent-mode t))
#+END_SRC

*** [beacon]
    Shows cursor position:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package beacon
  :custom
  (beacon-mode t "turn on beacon mode.")
  (beacon-blink-when-focused t "let the cursor blink when focused."))
#+END_SRC

*** [smex]
    Commands bar auto complete and suggestion:

#+BEGIN_SRC emacs-lisp
(use-package smex
  :bind (("M-x" . smex))
  :config (smex-initialize))
#+END_SRC

*** [company]
    Auto-complete engine:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package company
  :config
  (global-company-mode t))
#+END_SRC

*** [rust-mode]
    Rust-lang support:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package rust-mode
  :custom
  (company-tooltip-align-annotations t))
#+END_SRC

*** [racer]
    provide rust code completion with Company:

#+BEGIN_SRC emacs-lisp :tangle no
;; rustup component add rust-src
;; cargo install racer
(use-package racer
  :requires rust-mode
  :config
  (add-hook 'rust-mode-hook #'racer-mode)
  (add-hook 'racer-mode-hook #'eldoc-mode))
#+END_SRC

