emacs/.emacs.d/init.html

<div id="outline-container-sec-1-2-17" class="outline-4">
<h4 id="sec-1-2-17"><span class="section-number-4">1.2.17</span> Global Variables</h4>
<div class="outline-text-4" id="text-1-2-17">
<p>
Disable menu bar:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(menu-bar-mode -1)
</pre>
</div>

<p>
Disable tool bar:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(tool-bar-mode -1)
</pre>
</div>

<p>
Disable scroll bar:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(toggle-scroll-bar -1)
</pre>
</div>

<p>
Display line number:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-linum-mode t)
(setq-default linum-format " %d ")
</pre>
</div>

<p>
Every time bookmark is changed, automatically save it:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq bookmark-save-flag 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-18" class="outline-4">
<h4 id="sec-1-2-18"><span class="section-number-4">1.2.18</span> Font Settings</h4>
<div class="outline-text-4" id="text-1-2-18">
<p>
General settings:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; (set-frame-font "Ubuntu Mono")
;; (set-frame-font "More Perfect DOS VGA")
;; (set-frame-font "Unifont")
;; (set-frame-font "Terminus:antialias=none")
;; (set-face-attribute 'default nil :height 120)
;; (set-frame-font "Monaco")
(set-frame-font "Hack")
(set-face-attribute 'default nil :height 120)
</pre>
</div>

<p>
For Arch-Linux:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-frame-font "xos4 Terminus:antialias=none")
(set-face-attribute 'default nil :height 120)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-19" class="outline-4">
<h4 id="sec-1-2-19"><span class="section-number-4">1.2.19</span> Custom Settings File</h4>
<div class="outline-text-4" id="text-1-2-19">
<p>
Keep auto-generated settings in seperate file:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default custom-file "~/.emacs.d/auto-generated-customized-settings.el")
(load-file custom-file)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Functions</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun tareifz/load-only-theme ()
  "Disable all themes and then load a single theme interactively."
  (interactive)
  (while custom-enabled-themes
    (disable-theme (car custom-enabled-themes)))
  (call-interactively 'load-theme))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun tareifz/kill-line ()
  "Killing current line with the new line character, and put the cursor at the beginning of the line."
  (interactive)
  (let (line-begin line-end)
    (setq line-begin (line-beginning-position))
    (setq line-end (if (= (point-max) (line-end-position))
                       (progn
                         (line-end-position))
                     (progn
                       (forward-line 1)
                       (line-beginning-position))))
    (kill-region line-begin line-end)
    (beginning-of-line))
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Key Bindings</h3>
<div class="outline-text-3" id="text-1-4">
<p>
   Override [C-k] (kill-to-end-of-line).
the bind-key* (with star) will override key bindings in all minor modes:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(bind-key* "C-k" 'tareifz/kill-line)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Themes</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Custom User Themes</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
;; (load-file "~/.emacs.d/themes/tareifz-basic-theme.el")
;; (load-file "~/.emacs.d/themes/tareifz-shadows-theme.el")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Theme packages</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; (use-package sourcerer-theme)
;; (use-package dracula-theme)
;; (use-package atom-one-dark-theme)
(use-package hydandata-light-theme)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Packages</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> [org-mode]</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package org)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> [try]</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
This package let you try packages without installing
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package try)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> [smartparens]</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Auto-close parens:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package smartparens
  :config
  (smartparens-global-mode t))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> [rainbow-mode]</h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
Represent colors with the color they represent as background:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package rainbow-mode
  :config
  (add-hook 'prog-mode-hook #'rainbow-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-5" class="outline-4">
<h4 id="sec-1-6-5"><span class="section-number-4">1.6.5</span> [rainbow-delimiters]</h4>
<div class="outline-text-4" id="text-1-6-5">
<p>
Rainbow parentheses:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  :requires rainbow-mode
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-6" class="outline-4">
<h4 id="sec-1-6-6"><span class="section-number-4">1.6.6</span> [aggressive-indent]</h4>
<div class="outline-text-4" id="text-1-6-6">
<p>
Minor mode that keeps your code always indented:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package aggressive-indent
  :config
  (global-aggressive-indent-mode t))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-7" class="outline-4">
<h4 id="sec-1-6-7"><span class="section-number-4">1.6.7</span> [beacon]</h4>
<div class="outline-text-4" id="text-1-6-7">
<p>
Shows cursor position:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package beacon
  :custom
  (beacon-mode t "turn on beacon mode.")
  (beacon-blink-when-focused t "let the cursor blink when focused."))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-8" class="outline-4">
<h4 id="sec-1-6-8"><span class="section-number-4">1.6.8</span> [smex]</h4>
<div class="outline-text-4" id="text-1-6-8">
<p>
Commands bar auto complete and suggestion:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package smex
  :bind (("M-x" . smex))
  :config (smex-initialize))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-9" class="outline-4">
<h4 id="sec-1-6-9"><span class="section-number-4">1.6.9</span> [company]</h4>
<div class="outline-text-4" id="text-1-6-9">
<p>
Auto-complete engine:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package company
  :config
  (global-company-mode t))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-10" class="outline-4">
<h4 id="sec-1-6-10"><span class="section-number-4">1.6.10</span> [rust-mode]</h4>
<div class="outline-text-4" id="text-1-6-10">
<p>
Rust-lang support:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package rust-mode
  :custom
  (company-tooltip-align-annotations t))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-11" class="outline-4">
<h4 id="sec-1-6-11"><span class="section-number-4">1.6.11</span> [racer]</h4>
<div class="outline-text-4" id="text-1-6-11">
<p>
provide rust code completion with Company:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; rustup component add rust-src
;; cargo install racer
(use-package racer
  :requires rust-mode
  :config
  (add-hook 'rust-mode-hook #'racer-mode)
  (add-hook 'racer-mode-hook #'eldoc-mode))
</pre>
</div>
</div>
</div>
