emacs/.emacs.d/init.el

(setq bookmark-save-flag 1)

;; (set-frame-font "Ubuntu Mono")
;; (set-frame-font "More Perfect DOS VGA")
;; (set-frame-font "Unifont")
;; (set-frame-font "Terminus:antialias=none")
;; (set-face-attribute 'default nil :height 120)
;; (set-frame-font "Monaco")
(set-frame-font "Hack")
(set-face-attribute 'default nil :height 120)

(setq-default custom-file "~/.emacs.d/auto-generated-customized-settings.el")
(load-file custom-file)

(defun tareifz/load-only-theme ()
  "Disable all themes and then load a single theme interactively."
  (interactive)
  (while custom-enabled-themes
    (disable-theme (car custom-enabled-themes)))
  (call-interactively 'load-theme))

(defun tareifz/kill-line ()
  "Killing current line with the new line character, and put the cursor at the beginning of the line."
  (interactive)
  (let (line-begin line-end)
    (setq line-begin (line-beginning-position))
    (setq line-end (if (= (point-max) (line-end-position))
                       (progn
                         (line-end-position))
                     (progn
                       (forward-line 1)
                       (line-beginning-position))))
    (kill-region line-begin line-end)
    (beginning-of-line))
  )

(bind-key* "C-k" 'tareifz/kill-line)

;; (use-package sourcerer-theme)
;; (use-package dracula-theme)
;; (use-package atom-one-dark-theme)
(use-package hydandata-light-theme)

(use-package org)

(use-package try)

(use-package rainbow-delimiters
  :requires rainbow-mode
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package aggressive-indent
  :config
  (global-aggressive-indent-mode t))

(use-package smex
  :bind (("M-x" . smex))
  :config (smex-initialize))
