emacs/.emacs.d/init.org
*** [multiple-cursors]

#+BEGIN_SRC emacs-lisp :tangle no
(use-package multiple-cursors
  :config
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))
#+END_SRC

*** [switch-window]
    Will number the window when you try to switch:

#+BEGIN_SRC emacs-lisp
(use-package switch-window
  :config
  (global-set-key (kbd "C-x o") 'switch-window))
#+END_SRC

*** [web-mode]

#+BEGIN_SRC emacs-lisp :tangle no
(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode)))
#+END_SRC

*** [js2-mode]

#+BEGIN_SRC emacs-lisp :tangle no
(use-package js2-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode)))
#+END_SRC

*** [electric-operator]

#+BEGIN_SRC emacs-lisp :tangle no
(use-package electric-operator
  :config
  (add-hook 'rust-mode-hook #'electric-operator-mode)
  (add-hook 'javascript-mode-hook #'electric-operator-mode)
  (electric-operator-add-rules-for-mode 'rust-mode
                                        (cons "->" " -> ")))
#+END_SRC

*** [impatient-mode]
    Start a server and auto-refresh the page when change happens:

#+BEGIN_SRC emacs-lisp :tangle no
;; M-x httpd-start
;; M-x impatient-mode
;; http://localhost:8080/imp/
(use-package impatient-mode)
#+END_SRC

*** [which-key]
    Show possible completion for unfinished command:

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :config
  (which-key-mode)
  (which-key-setup-side-window-right-bottom))
#+END_SRC

*** [expand-region]
    Expand selection region outward:

#+BEGIN_SRC emacs-lisp
(use-package expand-region
  :bind ("C-=" . er/expand-region))
#+END_SRC

*** [flycheck]
    Linting engine:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package flycheck
  :init (global-flycheck-mode)
  :config
  (flycheck-add-mode 'javascript-eslint 'web-mode))
#+END_SRC

*** [flycheck-rust]
    Rust frontend for flycheck:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package flycheck-rust
  :requires (flycheck)
  :hook (rust-mode . flycheck-rust-setup))
#+END_SRC

*** [geiser]
    Scheme tools for Emacs:
#+BEGIN_SRC emacs-lisp :tangle no
;; C-c C-b === eval-buffer
;; C-c C-c === eval-definition.
(use-package geiser
  :config
  (setq geiser-active-implementations '(guile)))
#+END_SRC

*** [flymd]
    Live markdown preview:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package flymd
  :config
  (setq-default flymd-output-directory "~/.flymd/"))
#+END_SRC

*** [emmet-mode]
    Expand expression to HTML elements:

#+BEGIN_SRC emacs-lisp :tangle no
;; [C-j] to expand
(use-package emmet-mode
  :hook (web-mode . emmet-mode))
#+END_SRC

*** [diff-hl]
    Highlight git changes in buffer:

#+BEGIN_SRC emacs-lisp
(use-package diff-hl
  :config
  (global-diff-hl-mode)
  (diff-hl-flydiff-mode))
#+END_SRC
*** [projectile]

#+BEGIN_SRC emacs-lisp :tangle no
(use-package projectile
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :config
  (projectile-mode +1))
#+END_SRC
