emacs/.emacs.d/init.html

<div id="outline-container-sec-1-6-12" class="outline-4">
<h4 id="sec-1-6-12"><span class="section-number-4">1.6.12</span> [multiple-cursors]</h4>
<div class="outline-text-4" id="text-1-6-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package multiple-cursors
  :config
  (global-set-key (kbd "C-&gt;") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-&lt;") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-&lt;") 'mc/mark-all-like-this))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-13" class="outline-4">
<h4 id="sec-1-6-13"><span class="section-number-4">1.6.13</span> [switch-window]</h4>
<div class="outline-text-4" id="text-1-6-13">
<p>
Will number the window when you try to switch:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package switch-window
  :config
  (global-set-key (kbd "C-x o") 'switch-window))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-14" class="outline-4">
<h4 id="sec-1-6-14"><span class="section-number-4">1.6.14</span> [web-mode]</h4>
<div class="outline-text-4" id="text-1-6-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-15" class="outline-4">
<h4 id="sec-1-6-15"><span class="section-number-4">1.6.15</span> [js2-mode]</h4>
<div class="outline-text-4" id="text-1-6-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package js2-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-16" class="outline-4">
<h4 id="sec-1-6-16"><span class="section-number-4">1.6.16</span> [electric-operator]</h4>
<div class="outline-text-4" id="text-1-6-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package electric-operator
  :config
  (add-hook 'rust-mode-hook #'electric-operator-mode)
  (add-hook 'javascript-mode-hook #'electric-operator-mode)
  (electric-operator-add-rules-for-mode 'rust-mode
                                        (cons "-&gt;" " -&gt; ")))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-17" class="outline-4">
<h4 id="sec-1-6-17"><span class="section-number-4">1.6.17</span> [impatient-mode]</h4>
<div class="outline-text-4" id="text-1-6-17">
<p>
Start a server and auto-refresh the page when change happens:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; M-x httpd-start
;; M-x impatient-mode
;; http://localhost:8080/imp/
(use-package impatient-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-18" class="outline-4">
<h4 id="sec-1-6-18"><span class="section-number-4">1.6.18</span> [which-key]</h4>
<div class="outline-text-4" id="text-1-6-18">
<p>
Show possible completion for unfinished command:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package which-key
  :config
  (which-key-mode)
  (which-key-setup-side-window-right-bottom))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-19" class="outline-4">
<h4 id="sec-1-6-19"><span class="section-number-4">1.6.19</span> [expand-region]</h4>
<div class="outline-text-4" id="text-1-6-19">
<p>
Expand selection region outward:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package expand-region
  :bind ("C-=" . er/expand-region))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-20" class="outline-4">
<h4 id="sec-1-6-20"><span class="section-number-4">1.6.20</span> [flycheck]</h4>
<div class="outline-text-4" id="text-1-6-20">
<p>
Linting engine:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package flycheck
  :init (global-flycheck-mode)
  :config
  (flycheck-add-mode 'javascript-eslint 'web-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-21" class="outline-4">
<h4 id="sec-1-6-21"><span class="section-number-4">1.6.21</span> [flycheck-rust]</h4>
<div class="outline-text-4" id="text-1-6-21">
<p>
Rust frontend for flycheck:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package flycheck-rust
  :requires (flycheck)
  :hook (rust-mode . flycheck-rust-setup))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-22" class="outline-4">
<h4 id="sec-1-6-22"><span class="section-number-4">1.6.22</span> [geiser]</h4>
<div class="outline-text-4" id="text-1-6-22">
<p>
Scheme tools for Emacs:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; C-c C-b === eval-buffer
;; C-c C-c === eval-definition.
(use-package geiser
  :config
  (setq geiser-active-implementations '(guile)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-23" class="outline-4">
<h4 id="sec-1-6-23"><span class="section-number-4">1.6.23</span> [flymd]</h4>
<div class="outline-text-4" id="text-1-6-23">
<p>
Live markdown preview:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package flymd
  :config
  (setq-default flymd-output-directory "~/.flymd/"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-24" class="outline-4">
<h4 id="sec-1-6-24"><span class="section-number-4">1.6.24</span> [emmet-mode]</h4>
<div class="outline-text-4" id="text-1-6-24">
<p>
Expand expression to HTML elements:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; [C-j] to expand
(use-package emmet-mode
  :hook (web-mode . emmet-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-25" class="outline-4">
<h4 id="sec-1-6-25"><span class="section-number-4">1.6.25</span> [diff-hl]</h4>
<div class="outline-text-4" id="text-1-6-25">
<p>
Highlight git changes in buffer:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package diff-hl
  :config
  (global-diff-hl-mode)
  (diff-hl-flydiff-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6-26" class="outline-4">
<h4 id="sec-1-6-26"><span class="section-number-4">1.6.26</span> [projectile]</h4>
<div class="outline-text-4" id="text-1-6-26">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package projectile
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :config
  (projectile-mode +1))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tareif Al-Zamil</p>
<p class="date">Created: 2018-11-22 Thu 18:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
