emacs/.emacs.d/init.el

(use-package switch-window
  :config
  (global-set-key (kbd "C-x o") 'switch-window))

(use-package which-key
  :config
  (which-key-mode)
  (which-key-setup-side-window-right-bottom))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

(use-package diff-hl
  :config
  (global-diff-hl-mode)
  (diff-hl-flydiff-mode))
